* TODO Chapter 3
*** 3.2 Static Pages
    CLOCK: [2015-11-12 Thu 12:17]--[2015-11-12 Thu 12:28] =>  0:11
    CLOCK: [2015-11-12 Thu 10:21]--[2015-11-12 Thu 12:04] =>  1:43
*** TODO 3.3 Getting Started with testing
    CLOCK: [2015-11-12 Thu 15:00]--[2015-11-12 Thu 15:12] =>  0:12
    CLOCK: [2015-11-12 Thu 15:14]--[2015-11-12 Thu 15:19] =>  0:05
*** TODO 3.4 Slightly dynamic pages
    
